# Baby Names

## Task 1


The file is structured in the following way:
- There are 3 columns: Name, Gender (given as F or M), and the number how many babys were given the name.
- the columns are seperated by a comma.
- There is no header, only the data (body)

In [37]:
import pandas as pd # Import pandas

## Task 2

In [121]:
df = pd.read_csv('names/yob2021.txt') # Reads the file 'yob2021.txt' into pandas

## Task 3

#### Note: I gave the file a header, as it is easier to work with.

In [78]:
df.head(10) # Display the number of rows and columns

        Name Gender  Amount
0     Olivia      F   17728
1       Emma      F   15433
2  Charlotte      F   13285
3     Amelia      F   12952
4        Ava      F   12759
5     Sophia      F   12496
6   Isabella      F   11201
7        Mia      F   11096
8     Evelyn      F    9434
9     Harper      F    8388

## Task 4

In [40]:
print(df.shape)

(31537, 3)

## Task 5

In [41]:
df['Amount'].sum()

3361375

## Task 6

In [42]:
df.groupby("Gender").sum()

         Amount
Gender
F       1627098
M       1734277

## Task 7

In [79]:
df[df["Name"] == "Daniel"] # Check if my name exist in the dataframe (one could also use eq(Daniel).any)

         Name Gender  Amount
8541   Daniel      F      12
17559  Daniel      M    9066

## Task 8

In [81]:
df['Percentage'] = (df['Amount'] / df['Amount'].sum()) * 100 # Create new column, percentage
df.groupby("Gender").sum() # group by gender and sum the amount.

         Amount  Percentage
Gender
F       1627098   48.405727
M       1734277   51.594273

In [102]:
del df['Percentage'] # Delete percentage as we do not need it anymore

## Task 9

In [143]:
# Col1 = select name, where gender = f
# Col1.sortvalues()
male = df[df["Gender"] == "M"].sort_values(by=["Amount"], ascending=False).head(5) # Table of top 5 names, with male gender (+ Amount)
female = df[df["Gender"] == "F"].sort_values(by=["Amount"], ascending=False).head(5) # Table of top 5 names, with female gender (+ Amount)

male_names = male["Name"].tolist() # Convert column to list
female_names = female["Name"].tolist() # Convert column to list

data = {'Male': male_names, 'Female': female_names} # List of top 5 Male and Female names.

best_names = pd.DataFrame(data) # Create new Dataframe with data
best_names.index += 1 # Shift  Index, so it looks better.

best_names

     Male     Female
1    Liam     Olivia
2    Noah       Emma
3  Oliver  Charlotte
4  Elijah     Amelia
5   James        Ava

## Task 10

In [151]:
import openpyxl
best_names.to_excel("best_names.xlsx")